<?php
$status_codes = [
    [
        'name' => '白猫',
        'question' => '繊細でクールな一面があり、独占欲が強く、飼い主に甘えたがる。',
        'description' => '真っ白な猫は独占欲が強く、飼い主に甘えたがる一方で、ほかの猫に対してはとても強気な態度をみせます。
        性質としては、繊細でクールな一面があります。自然界では目立つ色であることから、警戒心が強い性格になったともいわれています。',
        'img' => 'cat_white.png'
    ],
    [
        'name' => '黒猫',
        'question' => '人懐っこく、甘えん坊で穏やか。頭の良い子が多い。',
        'description' => '黒猫は見た目のイメージとは違い、とても人懐っこい性格です。甘えん坊で、穏やかで、頭のいい子が多いのも特徴です。
        白猫とは反対にあまり目立たないせいか、警戒心が弱い傾向があります。ただし赤系の遺伝子をもつ黒猫の場合は、警戒心の強い性格になることもあります。',
        'img' => 'cat_black.png'
    ],
    [
        'name' => '白黒猫',
        'question' => '活発で好奇心旺盛。社交的で人懐っこい。',
        'description' => '文字通り、白と黒2色の毛色をもった猫です。黒の割合が多ければ「黒白」、白の割合が多ければ「白黒」と呼ばれます。
        それぞれ性格が異なるといわれていて、黒白は人懐っこく温和でマイペースな性格。白黒はおとなしそうにみえて、実は強気な性格をしているようです。',
        'img' => 'cat_black_white.png'
    ],
    [
        'name' => '三毛猫',
        'question' => '気分屋でマイペース。甘えん坊だが、ツンデレな一面も。',
        'description' => '白地にオレンジと黒の毛が混じった猫です。遺伝的に、オスが極めて珍しい模様です。
        運動神経抜群で好奇心が強く、器用で賢いのが特徴です。メス猫全般の気質でもありますが、マイペースでプライドが高く、いわゆるツンデレ傾向にあります。',
        'img' => 'cat_mike.png'
    ],
    [
        'name' => 'さび猫',
        'question' => '独立心が強く、気が強い。甘えん坊な面も持つ。',
        'description' => '黒と茶褐色の毛色がまだらになった猫で、別名「ベッコウ猫」とも呼ばれます。こちらも三毛と同様、オスが生まれることは珍しいです。
        メスが多いものの三毛とは異なり、それほど気は強くありません。愛嬌と協調性があり、甘えん坊です。頭がいいので初心者でも飼いやすい猫といえるでしょう。体が丈夫で長生きしやすいのも特徴です。',
        'img' => 'cat_sabi.png'
    ],
    [
        'name' => '茶トラ猫',
        'question' => '人懐っこく甘えん坊で活発。デリケートな一面も持つ。',
        'description' => '茶トラは薄いオレンジがかった毛色に赤褐色の縞模様が入った猫。キジトラに比べると薄く赤みがかった色合いです。
        茶トラの性格は人懐っこく甘えん坊で活発です。デリケートな一面がありますので、遊びや食べ物などの好みをしっかりと把握しておくことが大切です。',
        'img' => 'cat_chatora.png'
    ],
    [
        'name' => 'サバトラ猫',
        'question' => 'おっとりして人懐っこいタイプと、警戒心が強く慎重なタイプの両方が存在。',
        'description' => 'サバトラは明るい灰色ベースの毛に、黒い縞模様が入った猫です。魚の「サバ」に似た色をしていることから、この名前が付けられました。
        サバトラの性格は大きく2種類に分かれ、おっとりして人懐っこいタイプと、警戒心が強く慎重なタイプの両極端になることが多いです。',
        'img' => 'cat_sabatora.png'
    ],
    [
        'name' => 'キジトラ猫',
        'question' => '警戒心が強いが、一度懐くと甘えん坊。活発で遊び好き。',
        'description' => 'キジトラは猫の原型となった柄といわれるだけあって、個体数も多いです。
        性格は警戒心が強いものの、一度懐くとべったり甘えん坊に。
        ただし、あちこち動き回りたがる性分なので、長時間抱っこされることは好みません。懐いてくれたからといって構い過ぎないようにしましょう。',
        'img' => 'cat_kijitora.png'
    ],
    [
        'name' => '茶白猫',
        'question' => '人懐っこく甘えん坊で活発。デリケートな一面もあり、食欲旺盛。',
        'description' => '茶トラ柄がベースで、顔やおなか、手足などが白色の猫です。
        性格は茶トラの性質が強く影響しており、人懐っこく甘えん坊で活発です。また、ほかの猫とも仲よく接することができるので、多頭飼いを検討している家庭にはうってつけといえるでしょう。',
        'img' => 'cat_chatora_white.png'
    ],
    [
        'name' => 'サバ白猫',
        'question' => 'おっとりして人懐っこいタイプと、警戒心が強く慎重なタイプの両極端。',
        'description' => 'ベースが灰色に黒の縞模様で、おなかや足先が白色の猫です。
        性格はサバトラと同じく、おっとりして人懐っこいタイプと、警戒心が強く慎重なタイプに分かれることが多いとされています。白い毛色の部分多いほどプライドが高く、また賢い傾向にあるといわれます。',
        'img' => 'cat_sabatora_white.png'
    ],
    [
        'name' => 'キジ白猫',
        'question' => '活発で人懐っこい。警戒心もあるが、慣れると甘えん坊。',
        'description' => '基本的な模様はキジトラと同じですが、顔の下側やおなか、足先などが白い猫は、「キジ白」と呼ばれます。
        性格もキジトラと似たところがあり、警戒心がやや強め。打ち解ければ甘えてくれるようになるものの、抱っこはあまり好まないようです。体を動かすことが好きなので、猫じゃらしなどで遊んであげるといいでしょう。',
        'img' => 'cat_kijitora.png'
    ]
    ];
